status_msg={
    200:'成功',
    10000:'数据不完整',
    10011:'用户名不合法',
    10012:'密码不合法',
    10013:'二次密码不一致',
    10014:'手机号不合法',
    10015:'邮箱不合法',
    10016:'用户名重复,请重新选择用户名',
    10017:'',
    10018:'',
    20001:'数据添加数据库有异常',
    400:'数据不完整',
    404:'用户名或密码有误',
    10019:'帐号或密码不能为空',
    10020:'账户不存在',
    10021:'密码错误',
    10022:'TOKEN认没通过',






}
def to_dict_msg(status=200,data=None,msg=None):
    return {
        'status':status,
        'data':data,
        'msg':msg if msg else status_msg.get(status)


    }